Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4685.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF5EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF5EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF16">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF5EID8" edc:desc="" edc:mask="0x1" edc:name="RXF5EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID9" edc:desc="" edc:mask="0x1" edc:name="RXF5EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID10" edc:desc="" edc:mask="0x1" edc:name="RXF5EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID11" edc:desc="" edc:mask="0x1" edc:name="RXF5EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID12" edc:desc="" edc:mask="0x1" edc:name="RXF5EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID13" edc:desc="" edc:mask="0x1" edc:name="RXF5EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID14" edc:desc="" edc:mask="0x1" edc:name="RXF5EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID15" edc:desc="" edc:mask="0x1" edc:name="RXF5EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF5EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF5EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF17">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF5EID0" edc:desc="" edc:mask="0x1" edc:name="RXF5EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID1" edc:desc="" edc:mask="0x1" edc:name="RXF5EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID2" edc:desc="" edc:mask="0x1" edc:name="RXF5EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID3" edc:desc="" edc:mask="0x1" edc:name="RXF5EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID4" edc:desc="" edc:mask="0x1" edc:name="RXF5EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID5" edc:desc="" edc:mask="0x1" edc:name="RXF5EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID6" edc:desc="" edc:mask="0x1" edc:name="RXF5EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF5EID7" edc:desc="" edc:mask="0x1" edc:name="RXF5EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXM0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXM0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF18">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXM0SID3" edc:desc="" edc:mask="0x1" edc:name="RXM0SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0SID4" edc:desc="" edc:mask="0x1" edc:name="RXM0SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0SID5" edc:desc="" edc:mask="0x1" edc:name="RXM0SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0SID6" edc:desc="" edc:mask="0x1" edc:name="RXM0SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0SID7" edc:desc="" edc:mask="0x1" edc:name="RXM0SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0SID8" edc:desc="" edc:mask="0x1" edc:name="RXM0SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0SID9" edc:desc="" edc:mask="0x1" edc:name="RXM0SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0SID10" edc:desc="" edc:mask="0x1" edc:name="RXM0SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
