Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4685.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2SIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="TXB2SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xF22">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB2EID16" edc:desc="" edc:mask="0x1" edc:name="TXB2EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID17" edc:desc="" edc:mask="0x1" edc:name="TXB2EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2EXIDE" edc:desc="" edc:mask="0x1" edc:name="TXB2EXIDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID0" edc:desc="" edc:mask="0x1" edc:name="TXB2SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID1" edc:desc="" edc:mask="0x1" edc:name="TXB2SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID2" edc:desc="" edc:mask="0x1" edc:name="TXB2SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF23">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB2EID8" edc:desc="" edc:mask="0x1" edc:name="TXB2EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID9" edc:desc="" edc:mask="0x1" edc:name="TXB2EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID10" edc:desc="" edc:mask="0x1" edc:name="TXB2EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID11" edc:desc="" edc:mask="0x1" edc:name="TXB2EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID12" edc:desc="" edc:mask="0x1" edc:name="TXB2EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID13" edc:desc="" edc:mask="0x1" edc:name="TXB2EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID14" edc:desc="" edc:mask="0x1" edc:name="TXB2EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID15" edc:desc="" edc:mask="0x1" edc:name="TXB2EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF24">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB2EID0" edc:desc="" edc:mask="0x1" edc:name="TXB2EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID1" edc:desc="" edc:mask="0x1" edc:name="TXB2EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID2" edc:desc="" edc:mask="0x1" edc:name="TXB2EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID3" edc:desc="" edc:mask="0x1" edc:name="TXB2EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID4" edc:desc="" edc:mask="0x1" edc:name="TXB2EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID5" edc:desc="" edc:mask="0x1" edc:name="TXB2EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID6" edc:desc="" edc:mask="0x1" edc:name="TXB2EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID7" edc:desc="" edc:mask="0x1" edc:name="TXB2EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n--nnnn" edc:cname="TXB2DLC" edc:desc="" edc:impl="0x4f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-u--uuuu" edc:name="TXB2DLC" edc:nzwidth="0x8" edc:por="-x--xxxx" edc:_addr="0xF25">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB2DLC0" edc:desc="" edc:mask="0x1" edc:name="TXB2DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2DLC1" edc:desc="" edc:mask="0x1" edc:name="TXB2DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2DLC2" edc:desc="" edc:mask="0x1" edc:name="TXB2DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2DLC3" edc:desc="" edc:mask="0x1" edc:name="TXB2DLC3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXB2RTR" edc:desc="" edc:mask="0x1" edc:name="TXB2RTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF26">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D00" edc:desc="" edc:mask="0x1" edc:name="TXB2D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D01" edc:desc="" edc:mask="0x1" edc:name="TXB2D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D02" edc:desc="" edc:mask="0x1" edc:name="TXB2D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D03" edc:desc="" edc:mask="0x1" edc:name="TXB2D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D04" edc:desc="" edc:mask="0x1" edc:name="TXB2D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D05" edc:desc="" edc:mask="0x1" edc:name="TXB2D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D06" edc:desc="" edc:mask="0x1" edc:name="TXB2D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D07" edc:desc="" edc:mask="0x1" edc:name="TXB2D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF27">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D10" edc:desc="" edc:mask="0x1" edc:name="TXB2D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D11" edc:desc="" edc:mask="0x1" edc:name="TXB2D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D12" edc:desc="" edc:mask="0x1" edc:name="TXB2D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D13" edc:desc="" edc:mask="0x1" edc:name="TXB2D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D14" edc:desc="" edc:mask="0x1" edc:name="TXB2D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D15" edc:desc="" edc:mask="0x1" edc:name="TXB2D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D16" edc:desc="" edc:mask="0x1" edc:name="TXB2D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D17" edc:desc="" edc:mask="0x1" edc:name="TXB2D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF28">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D20" edc:desc="" edc:mask="0x1" edc:name="TXB2D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D21" edc:desc="" edc:mask="0x1" edc:name="TXB2D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D22" edc:desc="" edc:mask="0x1" edc:name="TXB2D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D23" edc:desc="" edc:mask="0x1" edc:name="TXB2D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D24" edc:desc="" edc:mask="0x1" edc:name="TXB2D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D25" edc:desc="" edc:mask="0x1" edc:name="TXB2D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D26" edc:desc="" edc:mask="0x1" edc:name="TXB2D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D27" edc:desc="" edc:mask="0x1" edc:name="TXB2D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF29">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D30" edc:desc="" edc:mask="0x1" edc:name="TXB2D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D31" edc:desc="" edc:mask="0x1" edc:name="TXB2D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D32" edc:desc="" edc:mask="0x1" edc:name="TXB2D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D33" edc:desc="" edc:mask="0x1" edc:name="TXB2D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D34" edc:desc="" edc:mask="0x1" edc:name="TXB2D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D35" edc:desc="" edc:mask="0x1" edc:name="TXB2D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D36" edc:desc="" edc:mask="0x1" edc:name="TXB2D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D37" edc:desc="" edc:mask="0x1" edc:name="TXB2D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
